##### Handle Categorical Features
###### One Hot Encoding

In [1]:
import pandas as pd

In [13]:
df = pd.read_csv('titanic.csv',usecols=['Sex'])

In [14]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [17]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [19]:
df = pd.read_csv('titanic.csv',usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [23]:
df.dropna(inplace=True)

In [24]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [27]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [29]:
df = pd.read_csv('mercedes.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [35]:
for i in df.columns:
    print(len(df[i].unique()))

47
27
44
7
4
29
12

In [57]:
lst_10 = df['X1'].value_counts().head(10).index
lst_10 = list(lst_10)

In [58]:
import numpy as np
lst_10
for category in lst_10:
    df[category] = np.where(df['X1']==category,1,0)

In [66]:
lst_10.append('X1')

In [68]:
df[lst_10].head()

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v